/**
* @file Score.cpp
* @brief スコア保存
* @author 米澤駿介
* @date
* @details スコア保存
*/
#include "pch.h"
#include "Score.h"

//------------------------------------------------------------------
// 概要：コンストラクタ
// 引数：なし
//------------------------------------------------------------------
Score::Score():
	mScore(0),
	mBossNum(0)
{

}
//------------------------------------------------------------------
// 概要：デストラクタ
// 引数：なし
//-------------------------------------------------------------------
Score::~Score()
{
}

//----------------------------------------------------
// 概要：初期化
// 引数 : なし
// 戻り値：なし
//----------------------------------------------------
void Score::Initialize()
{
	mScore = 0;
}

//----------------------------------------------------
// 概要：スコアの加算
// 引数(score) : 加算されるスコア
// 戻り値：なし
//----------------------------------------------------
void Score::AddScore(int score)
{
	// スコアを加算する
	mScore += score;
}

//----------------------------------------------------
// 概要：スコアのゲッター
// 引数 : なし
// 戻り値 int：スコア
//----------------------------------------------------
int Score::GetScore() const
{
	return mScore;
}

//----------------------------------------------------
// 概要：ボスののゲッター
// 引数 : なし
// 戻り値 int：ボスナム
//----------------------------------------------------
int Score::GetBossNum() const
{
	return mBossNum;
}
//----------------------------------------------------
// 概要：ボスのセッター
// 引数(num) : ボスナム
// 戻り値 : なし
//----------------------------------------------------
void Score::SetBossNum(int num)
{
	mBossNum = num;
}
