/**
* @file Object.cpp
* @brief オブジェクトのクラス
* @author 米澤駿介
* @date 2022/04/26
* @details オブジェクトIObjectを継承している
*/
#include "pch.h"
#include "Object.h"

//------------------------------------------------------------------
// 概要：コンストラクタ
// 引数：なし
//------------------------------------------------------------------
Object::Object()
	: mPos(DirectX::SimpleMath::Vector3::Zero)
{
}

//------------------------------------------------------------------
// 概要：デストラクタ
// 引数：なし
//-------------------------------------------------------------------
Object::~Object()
{
}

//----------------------------------------------------
// 概要：初期化
// 引数 : なし
// 戻り値：なし
//----------------------------------------------------
void Object::Initialize()
{
}

//----------------------------------------------------
// 概要：更新
// 引数:なし
// 戻り値：なし
//----------------------------------------------------
void Object::Update()
{
}

//----------------------------------------------------------------------
// 概要：描画
// 引数(commonStates)：コモンステイトのポインタ
// 引数(camera)：カメラのポインタ
// 戻り値：なし
//---------------------------------------------------------------------
void Object::Draw(DirectX::CommonStates* commonStates, Camera* camera)
{
	UNREFERENCED_PARAMETER(commonStates);
	UNREFERENCED_PARAMETER(camera);
}

//------------------------------------------------------------------
// 概要：終了処理
// 引数：なし
// 戻り値：なし
//------------------------------------------------------------------
void Object::Finalize()
{
}

// セッターゲッター--------------------------------------------------------------

//---------------------------------------
// 概要：座標のゲッター
// 引数：なし
// 戻り値(Vector3)：オブジェクトの座標
//---------------------------------------
DirectX::SimpleMath::Vector3 Object::GetObjectPos() const
{
	return DirectX::SimpleMath::Vector3(mPos);
}

//---------------------------------------
// 概要：座標のセッター
// 引数(pos)：オブジェクトの座標
// 戻り値：なし
//---------------------------------------
void Object::SetObjectPos(const DirectX::SimpleMath::Vector3& pos)
{
	mPos = pos;
}